Nithin3200/Project_ECG/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v10.0
processor: LPC54618J512
package_id: LPC54618J512BD208
mcu_data: ksdk2_0
processor_version: 10.0.0
pin_labels:
- {pin_num: '6', pin_signal: PIO4_17/CAN1_TD/CTIMER1_CAP2/UTICK_CAP0/EMC_BLSN(2), label: WDT, identifier: WDT}
- {pin_num: '8', pin_signal: PIO3_23/FC2_CTS_SDA_SSEL0/UTICK_CAP3, label: ECGMUX1, identifier: ECGMUX1}
- {pin_num: '10', pin_signal: PIO4_18/CAN1_RD/CTIMER1_CAP3/UTICK_CAP1/EMC_BLSN(3), label: DEC, identifier: DEC}
- {pin_num: '11', pin_signal: PIO3_15/FC8_SCK/SD_WR_PRT, label: Port_Exp, identifier: Port_Exp}
- {pin_num: '12', pin_signal: PIO2_5/ENET_TX_ER/SD_POW_EN/FC1_CTS_SDA_SSEL0/CTIMER1_MAT2, label: SW_ERR, identifier: SW_ERR}
- {pin_num: '13', pin_signal: PIO3_14/SCT0_OUT4/FC9_RTS_SCL_SSEL1/CTIMER3_MAT1/TRACEDATA(2), label: Incr, identifier: Incr}
- {pin_num: '130', pin_signal: PIO2_27/LCD_VD(9)/FC9_SCK/FC3_SSEL2, label: EGAIN, identifier: EGAIN;EGAINA}
- {pin_num: '29', pin_signal: PIO2_7/ENET_COL/SD_D(1)/FREQME_GPIO_CLK_B/CTIMER0_CAP1, label: Enter, identifier: Enter}
- {pin_num: '37', pin_signal: PIO3_12/SCT0_OUT8/CTIMER3_CAP0/CLKOUT/EMC_CLK(1)/TRACECLK, label: EGAIN, identifier: EGAIN;EGAIN3;EGAINB}
- {pin_num: '43', pin_signal: PIO2_11/LCD_PWR/SD_VOLT(0)/FC5_SCK, label: QRS, identifier: QRS}
- {pin_num: '45', pin_signal: PIO2_12/LCD_LE/SD_VOLT(1)/USB0_IDVALUE/FC5_RXD_SDA_MOSI, label: DSCHG, identifier: DSCHG}
- {pin_num: '46', pin_signal: PIO3_20/FC9_SCK/SD_CARD_INT_N/CLKOUT/SCT0_OUT7, label: KeyBuff, identifier: KeyBuff}
- {pin_num: '47', pin_signal: PIO4_22/ENET_TXD3/SD_CARD_DET_N/FC2_RTS_SCL_SSEL1/CTIMER1_MAT3/EMC_D(17), label: Battfull, identifier: Battfull}
- {pin_num: '51', pin_signal: PIO0_11/FC6_RXD_SDA_MOSI_DATA/CTIMER2_MAT2/FREQME_GPIO_CLK_A/SWCLK/ADC0_1, label: Charge, identifier: Charge}
- {pin_num: '55', pin_signal: PIO0_31/FC0_CTS_SDA_SSEL0/SD_D(2)/CTIMER0_MAT1/SCT0_OUT3/TRACEDATA(0)/ADC0_5, label: AED, identifier: AED}
- {pin_num: '56', pin_signal: PIO1_0/FC0_RTS_SCL_SSEL1/SD_D(3)/CTIMER0_CAP2/SCT0_GPI4/TRACECLK/ADC0_6, label: Discharge, identifier: Discharged}
- {pin_num: '68', pin_signal: PIO3_18/FC8_CTS_SDA_SSEL0/SD_D(6)/CTIMER4_MAT0/CAN0_TD/SCT0_OUT5, label: Pacer, identifier: Pacer}
- {pin_num: '75', pin_signal: PIO3_13/SCT0_OUT9/FC9_CTS_SDA_SSEL0/CTIMER3_CAP1/EMC_FBCK/TRACEDATA(1), label: Sync, identifier: Sync}
- {pin_num: '89', pin_signal: PIO1_22/FC8_RTS_SCL_SSEL1/SD_CMD/CTIMER2_MAT3/SCT0_GPI5/FC4_SSEL3/EMC_CKE(1), label: QRSTrig, identifier: QRSTrig}
- {pin_num: '90', pin_signal: PIO2_18/LCD_VD(0)/FC3_RXD_SDA_MOSI/FC7_SCK/CTIMER3_MAT0, label: HVRST, identifier: HVRST}
- {pin_num: '93', pin_signal: PIO2_19/LCD_VD(1)/FC3_TXD_SCL_MISO/FC7_RXD_SDA_MOSI_DATA/CTIMER3_MAT1, label: QRSMux2, identifier: QRSMux2}
- {pin_num: '95', pin_signal: PIO2_20/LCD_VD(2)/FC3_RTS_SCL_SSEL1/FC7_TXD_SCL_MISO_WS/CTIMER3_MAT2/CTIMER4_CAP0, label: Event, identifier: Event}
- {pin_num: '114', pin_signal: PIO4_31/ENET_RX_CLK/SD_D(6)/CTIMER3_MAT1/FC4_SCK/EMC_D(26), label: CPR, identifier: CPR}
- {pin_num: '120', pin_signal: PIO1_3/CAN0_RD/SCT0_OUT4/PDM1_DATA/USB0_PORTPWRN, label: ENCA, identifier: ENC;ENCA}
- {pin_num: '124', pin_signal: PIO2_26/LCD_VD(8)/FC3_SCK/CTIMER2_CAP1, label: QRSMux1, identifier: QRSMux1}
- {pin_num: '147', pin_signal: PIO4_4/FC4_SSEL3/FC0_RTS_SCL_SSEL1/SCT0_GPI5/EMC_DYCSN(3), label: PacerEN, identifier: PacerEN}
- {pin_num: '154', pin_signal: PIO4_5/FC9_CTS_SDA_SSEL0/FC0_CTS_SDA_SSEL0/CTIMER4_MAT3/SCT0_GPI6/EMC_CKE(2), label: Print, identifier: Print}
- {pin_num: '168', pin_signal: PIO5_10/SCT0_GPI5/FC5_RTS_SCL_SSEL1/SCT0_OUT9/UTICK_CAP3, label: NIBP, identifier: NIBP}
- {pin_num: '169', pin_signal: PIO3_3/LCD_VD(17)/FC9_TXD_SCL_MISO, label: RENReset, identifier: RENReset}
- {pin_num: '172', pin_signal: PIO3_4/LCD_VD(18)/FC8_CTS_SDA_SSEL0/CTIMER4_CAP1, label: AudioEn, identifier: AudioEn}
- {pin_num: '179', pin_signal: PIO5_9/SCT0_GPI4/PDM0_DATA/FC5_CTS_SDA_SSEL0/SCT0_OUT8/TRACEDATA(3)/EMC_A(25), label: Monitor, identifier: Monitor}
- {pin_num: '181', pin_signal: PIO4_10/ENET_RX_DV/FC2_TXD_SCL_MISO/USB1_OVERCURRENTN/USB1_UP_LED/SCT0_GPI3, label: Mute, identifier: Mute}
- {pin_num: '190', pin_signal: PIO4_13/ENET_TX_EN/CTIMER4_MAT0/SCT0_GPI6, label: Manual, identifier: Manual}
- {pin_num: '199', pin_signal: PIO3_10/SCT0_OUT3/CTIMER3_MAT0/EMC_DYCSN(1)/TRACEDATA(0), label: PWRHld, identifier: PWRHld}
- {pin_num: '200', pin_signal: PIO0_30/FC0_TXD_SCL_MISO/CTIMER0_MAT0/SCT0_OUT9/TRACEDATA(1), label: ENCB, identifier: ENC_Int;ENCB}
- {pin_num: '196', pin_signal: PIO0_0/CAN1_RD/FC3_SCK/CTIMER0_MAT0/SCT0_GPI0/PDM0_CLK, label: PWR_Int, identifier: PWR_Int}
- {pin_num: '202', pin_signal: PIO5_2/ENET_COL/SD_VOLT(1)/CTIMER3_CAP0/FC4_CTS_SDA_SSEL0/EMC_D(29), label: ECG_Type, identifier: ECG_Type}
- {pin_num: '161', pin_signal: PIO4_6/FC9_RTS_SCL_SSEL1/SCT0_GPI7/EMC_CKE(3), label: Cartridge, identifier: Cartridge}
- {pin_num: '164', pin_signal: PIO3_2/LCD_VD(16)/FC9_RXD_SDA_MOSI/CTIMER1_MAT2, label: Print_Rst, identifier: Print_Rst}
- {pin_num: '167', pin_signal: PIO0_29/FC0_RXD_SDA_MOSI/CTIMER2_MAT3/SCT0_OUT8/TRACEDATA(2), label: PWR_IN, identifier: PWR_IN}
- {pin_num: '44', pin_signal: PIO3_19/FC8_RTS_SCL_SSEL1/SD_D(7)/CTIMER4_MAT1/CAN0_RD/SCT0_OUT6, label: LED1, identifier: LED1}
- {pin_num: '116', pin_signal: PIO3_30/FC9_CTS_SDA_SSEL0/SCT0_OUT4/FC4_SSEL2/EMC_A(19), label: LED2, identifier: LED2}
- {pin_num: '123', pin_signal: PIO3_31/FC9_RTS_SCL_SSEL1/SCT0_OUT5/CTIMER4_MAT2/SCT0_GPI0/EMC_A(20), label: LCD_PWR, identifier: LCD_PWR}
- {pin_num: '208', pin_signal: PIO3_11/MCLK/FC0_SCK/FC1_SCK/TRACEDATA(3), label: mclk, identifier: mclk}
- {pin_num: '141', pin_signal: PIO0_13/FC1_CTS_SDA_SSEL0/UTICK_CAP0/CTIMER0_CAP0/SCT0_GPI0/ENET_RXD0, label: Renesas}
- {pin_num: '166', pin_signal: PIO4_7/CTIMER4_CAP3/USB0_PORTPWRN/USB0_FRAME/SCT0_GPI0, label: USB0PWR, identifier: USB0PWR}
- {pin_num: '16', pin_signal: PIO3_24/FC2_RTS_SCL_SSEL1/CTIMER4_CAP0/USB0_VBUS, label: VBUS, identifier: USB0VBUS}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"

#include "pin_mux.h"

