Nithin3200/Project_ECG/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '61', peripheral: ADC0, signal: 'CH, 9', pin_signal: PIO3_21/FC9_RXD_SDA_MOSI/SD_BACKEND_PWR/CTIMER4_MAT3/UTICK_CAP2/ADC0_9, mode: inactive}
  - {pin_num: '62', peripheral: ADC0, signal: 'CH, 10', pin_signal: PIO3_22/FC9_TXD_SCL_MISO/ADC0_10}
  - {pin_num: '5', peripheral: EMC, signal: 'EMC_A, 4', pin_signal: PIO1_5/FC0_RXD_SDA_MOSI/SD_D(2)/CTIMER2_MAT0/SCT0_GPI0/EMC_A(4), slew_rate: fast}
  - {pin_num: '30', peripheral: EMC, signal: 'EMC_A, 5', pin_signal: PIO1_6/FC0_TXD_SCL_MISO/SD_D(3)/CTIMER2_MAT1/SCT0_GPI3/EMC_A(5), slew_rate: fast}
  - {pin_num: '38', peripheral: EMC, signal: 'EMC_A, 6', pin_signal: PIO1_7/FC0_RTS_SCL_SSEL1/SD_D(1)/CTIMER2_MAT2/SCT0_GPI4/EMC_A(6), slew_rate: fast}
  - {pin_num: '72', peripheral: EMC, signal: 'EMC_A, 7', pin_signal: PIO1_8/FC0_CTS_SDA_SSEL0/SD_CLK/SCT0_OUT1/FC4_SSEL2/EMC_A(7), slew_rate: fast}
  - {pin_num: '82', peripheral: EMC, signal: 'EMC_A, 14', pin_signal: PIO3_25/CTIMER4_CAP2/FC4_SCK/EMC_A(14), slew_rate: fast}
  - {pin_num: '88', peripheral: EMC, signal: 'EMC_A, 15', pin_signal: PIO3_26/SCT0_OUT0/FC4_RXD_SDA_MOSI/EMC_A(15), slew_rate: fast}
  - {pin_num: '96', peripheral: EMC, signal: 'EMC_A, 16', pin_signal: PIO3_27/SCT0_OUT1/FC4_TXD_SCL_MISO/EMC_A(16), slew_rate: fast}
  - {pin_num: '100', peripheral: EMC, signal: 'EMC_A, 17', pin_signal: PIO3_28/SCT0_OUT2/FC4_CTS_SDA_SSEL0/EMC_A(17), slew_rate: fast}
  - {pin_num: '97', peripheral: EMC, signal: 'EMC_A, 11', pin_signal: PIO1_23/FC2_SCK/SCT0_OUT0/ENET_MDIO/FC3_SSEL2/EMC_A(11), slew_rate: fast}
  - {pin_num: '111', peripheral: EMC, signal: 'EMC_A, 12', pin_signal: PIO1_24/FC2_RXD_SDA_MOSI/SCT0_OUT1/FC3_SSEL3/EMC_A(12), slew_rate: fast}
  - {pin_num: '119', peripheral: EMC, signal: 'EMC_A, 13', pin_signal: PIO1_25/FC2_TXD_SCL_MISO/SCT0_OUT2/UTICK_CAP0/EMC_A(13), slew_rate: fast}
  - {pin_num: '112', peripheral: EMC, signal: 'EMC_A, 18', pin_signal: PIO3_29/SCT0_OUT3/FC4_RTS_SCL_SSEL1/EMC_A(18), slew_rate: fast}
  - {pin_num: '131', peripheral: EMC, signal: 'EMC_A, 8', pin_signal: PIO1_26/FC2_CTS_SDA_SSEL0/SCT0_OUT3/CTIMER0_CAP3/UTICK_CAP1/EMC_A(8), slew_rate: fast}
  - {pin_num: '142', peripheral: EMC, signal: 'EMC_A, 9', pin_signal: PIO1_27/FC2_RTS_SCL_SSEL1/SD_D(4)/CTIMER0_MAT3/CLKOUT/EMC_A(9), slew_rate: fast}
  - {pin_num: '150', peripheral: EMC, signal: 'EMC_A, 0', pin_signal: PIO0_18/FC4_CTS_SDA_SSEL0/SD_WR_PRT/CTIMER1_MAT0/SCT0_OUT1/SCI1_SCLK/EMC_A(0), slew_rate: fast}
  - {pin_num: '153', peripheral: EMC, signal: 'EMC_A, 2', pin_signal: PIO0_20/FC3_CTS_SDA_SSEL0/CTIMER1_MAT1/CTIMER3_CAP3/SCT0_GPI2/SCI0_IO/EMC_A(2)/FC7_RXD_SDA_MOSI_DATA,
    slew_rate: fast}
  - {pin_num: '158', peripheral: EMC, signal: 'EMC_A, 3', pin_signal: PIO0_21/FC3_RTS_SCL_SSEL1/UTICK_CAP3/CTIMER3_MAT3/SCT0_GPI3/SCI0_SCLK/EMC_A(3)/FC7_SCK, slew_rate: fast}
  - {pin_num: '187', peripheral: EMC, signal: 'EMC_A, 10', pin_signal: PIO1_16/ENET_MDC/FC6_TXD_SCL_MISO_WS/CTIMER1_MAT3/SD_CMD/EMC_A(10), slew_rate: fast}
  - {pin_num: '193', peripheral: EMC, signal: 'EMC_A, 1', pin_signal: PIO0_19/FC4_RTS_SCL_SSEL1/UTICK_CAP0/CTIMER0_MAT2/SCT0_OUT2/EMC_A(1)/FC7_TXD_SCL_MISO_WS, slew_rate: fast}
  - {pin_num: '3', peripheral: EMC, signal: 'EMC_D, 11', pin_signal: PIO1_4/FC0_SCK/SD_D(0)/CTIMER2_MAT1/SCT0_OUT0/FREQME_GPIO_CLK_A/EMC_D(11), slew_rate: fast}
  - {pin_num: '33', peripheral: EMC, signal: 'EMC_D, 8', pin_signal: PIO1_19/FC8_SCK/SCT0_OUT7/CTIMER3_MAT1/SCT0_GPI7/FC4_SCK/EMC_D(8), slew_rate: fast}
  - {pin_num: '35', peripheral: EMC, signal: 'EMC_D, 9', pin_signal: PIO1_20/FC7_RTS_SCL_SSEL1/CTIMER3_CAP2/FC4_TXD_SCL_MISO/EMC_D(9), slew_rate: fast}
  - {pin_num: '74', peripheral: EMC, signal: 'EMC_D, 10', pin_signal: PIO1_21/FC7_CTS_SDA_SSEL0/CTIMER3_MAT2/FC4_RXD_SDA_MOSI/EMC_D(10), slew_rate: fast}
  - {pin_num: '125', peripheral: EMC, signal: 'EMC_D, 5', pin_signal: PIO0_7/FC3_RTS_SCL_SSEL1/SD_CLK/FC5_SCK/FC1_SCK/PDM1_CLK/EMC_D(5)/ENET_RX_CLK, slew_rate: fast}
  - {pin_num: '133', peripheral: EMC, signal: 'EMC_D, 6', pin_signal: PIO0_8/FC3_SSEL3/SD_CMD/FC5_RXD_SDA_MOSI/SWO/PDM1_DATA/EMC_D(6), slew_rate: fast}
  - {pin_num: '136', peripheral: EMC, signal: 'EMC_D, 7', pin_signal: PIO0_9/FC3_SSEL2/SD_POW_EN/FC5_TXD_SCL_MISO/SCI1_IO/EMC_D(7), slew_rate: fast}
  - {pin_num: '151', peripheral: EMC, signal: 'EMC_D, 12', pin_signal: PIO1_28/FC7_SCK/SD_D(5)/CTIMER0_CAP2/EMC_D(12), slew_rate: fast}
  - {pin_num: '165', peripheral: EMC, signal: 'EMC_D, 13', pin_signal: PIO1_29/FC7_RXD_SDA_MOSI_DATA/SD_D(6)/SCT0_GPI6/USB1_PORTPWRN/USB1_FRAME/EMC_D(13), slew_rate: fast}
  - {pin_num: '174', peripheral: EMC, signal: 'EMC_D, 0', pin_signal: PIO0_2/FC3_TXD_SCL_MISO/CTIMER0_CAP1/SCT0_OUT0/SCT0_GPI2/EMC_D(0), slew_rate: fast}
  - {pin_num: '178', peripheral: EMC, signal: 'EMC_D, 1', pin_signal: PIO0_3/FC3_RXD_SDA_MOSI/CTIMER0_MAT1/SCT0_OUT1/SCT0_GPI3/EMC_D(1), slew_rate: fast}
  - {pin_num: '182', peripheral: EMC, signal: 'EMC_D, 14', pin_signal: PIO1_30/FC7_TXD_SCL_MISO_WS/SD_D(7)/SCT0_GPI7/USB1_OVERCURRENTN/USB1_UP_LED/EMC_D(14), slew_rate: fast}
  - {pin_num: '185', peripheral: EMC, signal: 'EMC_D, 2', pin_signal: PIO0_4/CAN0_RD/FC4_SCK/CTIMER3_CAP0/SCT0_GPI4/EMC_D(2)/ENET_MDC, slew_rate: fast}
  - {pin_num: '189', peripheral: EMC, signal: 'EMC_D, 3', pin_signal: PIO0_5/CAN0_TD/FC4_RXD_SDA_MOSI/CTIMER3_MAT0/SCT0_GPI5/EMC_D(3)/ENET_MDIO, slew_rate: fast}
  - {pin_num: '191', peripheral: EMC, signal: 'EMC_D, 4', pin_signal: PIO0_6/FC3_SCK/CTIMER3_CAP1/CTIMER4_MAT0/SCT0_GPI6/EMC_D(4)/ENET_RX_DV, slew_rate: fast}
  - {pin_num: '195', peripheral: EMC, signal: 'EMC_D, 15', pin_signal: PIO1_31/MCLK/CTIMER0_MAT2/SCT0_OUT6/FC8_CTS_SDA_SSEL0/EMC_D(15), slew_rate: fast}
  - {pin_num: '54', peripheral: EMC, signal: 'EMC_CS, 0', pin_signal: PIO0_16/FC4_TXD_SCL_MISO/CLKOUT/CTIMER1_CAP0/EMC_CSN(0)/ENET_TXD0/ADC0_4}
  - {pin_num: '15', peripheral: EMC, signal: 'EMC_BLS, 1', pin_signal: PIO1_18/FC8_TXD_SCL_MISO/SCT0_OUT5/CAN1_RD/EMC_BLSN(1), slew_rate: fast}
  - {pin_num: '78', peripheral: EMC, signal: EMC_CAS, pin_signal: PIO1_9/ENET_TXD0/FC1_SCK/CTIMER1_CAP0/SCT0_OUT2/FC4_CTS_SDA_SSEL0/EMC_CASN, slew_rate: fast}
  - {pin_num: '98', peripheral: EMC, signal: 'EMC_BLS, 0', pin_signal: PIO1_17/ENET_MDIO/FC8_RXD_SDA_MOSI/SCT0_OUT4/CAN1_TD/EMC_BLSN(0), slew_rate: fast}
  - {pin_num: '176', peripheral: EMC, signal: 'EMC_CKE, 0', pin_signal: PIO1_15/ENET_RX_CLK/UTICK_CAP3/CTIMER1_CAP3/FC5_RTS_SCL_SSEL1/FC4_RTS_SCL_SSEL1/EMC_CKE(0),
    slew_rate: fast}
  - {pin_num: '198', peripheral: EMC, signal: 'EMC_CLK, 0', pin_signal: PIO1_11/ENET_TX_EN/FC1_TXD_SCL_MISO/CTIMER1_CAP1/USB0_VBUS/EMC_CLK(0), slew_rate: fast}
  - {pin_num: '127', peripheral: EMC, signal: 'EMC_CS, 1', pin_signal: PIO4_0/FC6_CTS_SDA_SSEL0/CTIMER4_CAP1/SCT0_GPI1/EMC_CSN(1), slew_rate: fast}
  - {pin_num: '132', peripheral: EMC, signal: 'EMC_CS, 2', pin_signal: PIO4_1/FC6_SCK/SCT0_GPI2/EMC_CSN(2), slew_rate: fast}
  - {pin_num: '139', peripheral: EMC, signal: 'EMC_DQM, 0', pin_signal: PIO1_13/ENET_RXD1/FC6_RXD_SDA_MOSI_DATA/CTIMER1_CAP2/USB0_OVERCURRENTN/USB0_FRAME/EMC_DQM(0),
    slew_rate: fast}
  - {pin_num: '160', peripheral: EMC, signal: 'EMC_DQM, 1', pin_signal: PIO1_14/ENET_RX_DV/UTICK_CAP2/CTIMER1_MAT2/FC5_CTS_SDA_SSEL0/USB0_UP_LED/EMC_DQM(1), slew_rate: fast}
  - {pin_num: '128', peripheral: EMC, signal: 'EMC_DYCS, 0', pin_signal: PIO1_12/ENET_RXD0/FC6_SCK/CTIMER1_MAT1/USB0_PORTPWRN/EMC_DYCSN(0), slew_rate: fast}
  - {pin_num: '146', peripheral: EMC, signal: EMC_OE, pin_signal: PIO0_17/FC4_SSEL2/SD_CARD_DET_N/SCT0_GPI7/SCT0_OUT0/EMC_OEN/ENET_TXD1, slew_rate: fast}
  - {pin_num: '84', peripheral: EMC, signal: EMC_RAS, pin_signal: PIO1_10/ENET_TXD1/FC1_RXD_SDA_MOSI/CTIMER1_MAT0/SCT0_OUT3/EMC_RASN, slew_rate: fast}
  - {pin_num: '53', peripheral: EMC, signal: EMC_WE, pin_signal: PIO0_15/FC6_CTS_SDA_SSEL0/UTICK_CAP2/CTIMER4_CAP0/SCT0_OUT2/EMC_WEN/ENET_TX_EN/ADC0_3, mode: pullUp}
  - {pin_num: '70', peripheral: LCD, signal: LCD_DCLK, pin_signal: PIO2_13/LCD_DCLK/SD_VOLT(2)/FC5_TXD_SCL_MISO, slew_rate: fast}
  - {pin_num: '77', peripheral: LCD, signal: LCD_FP, pin_signal: PIO2_14/LCD_FP/USB0_FRAME/USB0_PORTPWRN/CTIMER0_MAT2/FC5_CTS_SDA_SSEL0, slew_rate: fast}
  - {pin_num: '79', peripheral: LCD, signal: LCD_AC, pin_signal: PIO2_15/LCD_AC/USB0_UP_LED/USB0_OVERCURRENTN/CTIMER0_MAT3/FC5_RTS_SCL_SSEL1, slew_rate: fast}
  - {pin_num: '81', peripheral: LCD, signal: LCD_LP, pin_signal: PIO2_16/LCD_LP/USB1_FRAME/USB1_PORTPWRN/CTIMER1_MAT3/FC8_SCK, slew_rate: fast}
  - {pin_num: '99', peripheral: LCD, signal: 'LCD_VD, 3', pin_signal: PIO2_21/LCD_VD(3)/FC3_CTS_SDA_SSEL0/MCLK/CTIMER3_MAT3, slew_rate: fast}
  - {pin_num: '113', peripheral: LCD, signal: 'LCD_VD, 4', pin_signal: PIO2_22/LCD_VD(4)/SCT0_OUT7/CTIMER2_CAP0, slew_rate: fast}
  - {pin_num: '115', peripheral: LCD, signal: 'LCD_VD, 5', pin_signal: PIO2_23/LCD_VD(5)/SCT0_OUT8, slew_rate: fast}
  - {pin_num: '118', peripheral: LCD, signal: 'LCD_VD, 6', pin_signal: PIO2_24/LCD_VD(6)/SCT0_OUT9, slew_rate: fast}
  - {pin_num: '121', peripheral: LCD, signal: 'LCD_VD, 7', pin_signal: PIO2_25/LCD_VD(7)/USB0_VBUS, slew_rate: fast}
  - {pin_num: '134', peripheral: LCD, signal: 'LCD_VD, 10', pin_signal: PIO2_28/LCD_VD(10)/FC7_CTS_SDA_SSEL0/CTIMER2_CAP2, slew_rate: fast}
  - {pin_num: '137', peripheral: LCD, signal: 'LCD_VD, 11', pin_signal: PIO2_29/LCD_VD(11)/FC7_RTS_SCL_SSEL1/FC8_TXD_SCL_MISO/CTIMER2_CAP3/CLKOUT, slew_rate: fast}
  - {pin_num: '143', peripheral: LCD, signal: 'LCD_VD, 12', pin_signal: PIO2_30/LCD_VD(12)/CTIMER2_MAT2, slew_rate: fast}
  - {pin_num: '149', peripheral: LCD, signal: 'LCD_VD, 13', pin_signal: PIO2_31/LCD_VD(13), slew_rate: fast}
  - {pin_num: '155', peripheral: LCD, signal: 'LCD_VD, 14', pin_signal: PIO3_0/LCD_VD(14)/PDM0_CLK/CTIMER1_MAT0, slew_rate: fast}
  - {pin_num: '159', peripheral: LCD, signal: 'LCD_VD, 15', pin_signal: PIO3_1/LCD_VD(15)/PDM0_DATA/CTIMER1_MAT1, slew_rate: fast}
  - {pin_num: '177', peripheral: LCD, signal: 'LCD_VD, 19', pin_signal: PIO3_5/LCD_VD(19)/FC8_RTS_SCL_SSEL1/CTIMER4_MAT1, slew_rate: fast}
  - {pin_num: '180', peripheral: LCD, signal: 'LCD_VD, 20', pin_signal: PIO3_6/LCD_VD(20)/LCD_VD(0)/CTIMER4_MAT2, slew_rate: fast}
  - {pin_num: '184', peripheral: LCD, signal: 'LCD_VD, 21', pin_signal: PIO3_7/LCD_VD(21)/LCD_VD(1)/CTIMER4_CAP2, slew_rate: fast}
  - {pin_num: '186', peripheral: LCD, signal: 'LCD_VD, 22', pin_signal: PIO3_8/LCD_VD(22)/LCD_VD(2)/CTIMER4_CAP3, slew_rate: fast}
  - {pin_num: '192', peripheral: LCD, signal: 'LCD_VD, 23', pin_signal: PIO3_9/LCD_VD(23)/LCD_VD(3)/CTIMER0_CAP2, slew_rate: fast}
  - {pin_num: '4', peripheral: ENET, signal: ENET_CRS, pin_signal: PIO2_2/ENET_CRS/FC3_SSEL3/SCT0_OUT6/CTIMER1_MAT1}
  - {pin_num: '14', peripheral: ENET, signal: 'ENET_TXD, 0', pin_signal: PIO4_19/ENET_TXD0/SD_CLK/FC2_SCK/CTIMER4_CAP2/EMC_DQM(2)}
  - {pin_num: '18', peripheral: ENET, signal: 'ENET_TXD, 1', pin_signal: PIO4_20/ENET_TXD1/SD_CMD/FC2_RXD_SDA_MOSI/CTIMER4_CAP3/EMC_DQM(3)}
  - {pin_num: '42', peripheral: ENET, signal: 'ENET_RXD, 0', pin_signal: PIO4_23/ENET_RXD0/SD_WR_PRT/FC2_CTS_SDA_SSEL0/CTIMER1_MAT0/EMC_D(18)}
  - {pin_num: '80', peripheral: ENET, signal: ENET_TX_CLK, pin_signal: PIO4_30/ENET_TX_CLK/SD_D(5)/CTIMER3_MAT0/FC1_RTS_SCL_SSEL1/CTIMER1_CAP3/EMC_D(25)}
  - {pin_num: '85', peripheral: ENET, signal: ENET_TX_EN, pin_signal: PIO4_27/ENET_TX_EN/SD_D(2)/FC1_SCK/CTIMER1_CAP0/EMC_D(22)}
  - {pin_num: '129', peripheral: ENET, signal: ENET_MDC, pin_signal: PIO5_3/ENET_MDC/SD_VOLT(2)/CTIMER3_CAP1/FC4_RTS_SCL_SSEL1/EMC_D(30)}
  - {pin_num: '135', peripheral: ENET, signal: ENET_MDIO, pin_signal: PIO5_4/ENET_MDIO/SD_BACKEND_PWR/CTIMER3_CAP2/FC4_SSEL2/EMC_D(31)}
  - {pin_num: '188', peripheral: ENET, signal: 'ENET_RXD, 1', pin_signal: PIO4_12/ENET_RXD1/FC2_RTS_SCL_SSEL1/SCT0_GPI5}
  - {pin_num: '194', peripheral: ENET, signal: ENET_RX_CLK, pin_signal: PIO4_14/ENET_RX_CLK/CTIMER4_MAT1/FC9_SCK/SCT0_GPI7}
  - {pin_num: '71', peripheral: SPIFI0, signal: SPIFI_CSN, pin_signal: PIO0_23/MCLK/CTIMER1_MAT2/CTIMER3_MAT3/SCT0_OUT4/SPIFI_CSN/ADC0_11}
  - {pin_num: '76', peripheral: SPIFI0, signal: SPIFI_IO0/SPIFI_MOSI, pin_signal: PIO0_24/FC0_RXD_SDA_MOSI/SD_D(0)/CTIMER2_CAP0/SCT0_GPI0/SPIFI_IO(0)}
  - {pin_num: '87', peripheral: SPIFI0, signal: 'SPIFI_IO, 3', pin_signal: PIO0_27/FC2_TXD_SCL_MISO/CTIMER3_MAT2/SCT0_OUT6/PDM0_DATA/SPIFI_IO(3)}
  - {pin_num: '91', peripheral: SPIFI0, signal: 'SPIFI_IO, 2', pin_signal: PIO0_28/FC0_SCK/CTIMER2_CAP3/SCT0_OUT7/TRACEDATA(3)/SPIFI_IO(2)/USB0_OVERCURRENTN}
  - {pin_num: '110', peripheral: SPIFI0, signal: SPIFI_SCK, pin_signal: PIO0_26/FC2_RXD_SDA_MOSI/CLKOUT/CTIMER3_CAP2/SCT0_OUT5/PDM0_CLK/SPIFI_CLK/USB0_IDVALUE}
  - {pin_num: '83', peripheral: SPIFI0, signal: SPIFI_IO1/SPIFI_MISO, pin_signal: PIO0_25/FC0_TXD_SCL_MISO/SD_D(1)/CTIMER2_CAP1/SCT0_GPI1/SPIFI_IO(1)}
  - {pin_num: '69', peripheral: FLEXCOMM7, signal: CTS_SDA_SSEL0, pin_signal: PIO4_25/ENET_RXD2/SD_D(0)/FC7_CTS_SDA_SSEL0/CTIMER1_MAT2/EMC_D(20), mode: pullDown,
    slew_rate: fast, open_drain: enabled}
  - {pin_num: '6', peripheral: GPIO, signal: 'PIO4, 17', pin_signal: PIO4_17/CAN1_TD/CTIMER1_CAP2/UTICK_CAP0/EMC_BLSN(2), direction: OUTPUT}
  - {pin_num: '8', peripheral: GPIO, signal: 'PIO3, 23', pin_signal: PIO3_23/FC2_CTS_SDA_SSEL0/UTICK_CAP3, direction: INPUT}
  - {pin_num: '10', peripheral: GPIO, signal: 'PIO4, 18', pin_signal: PIO4_18/CAN1_RD/CTIMER1_CAP3/UTICK_CAP1/EMC_BLSN(3), direction: INPUT}
  - {pin_num: '11', peripheral: GPIO, signal: 'PIO3, 15', pin_signal: PIO3_15/FC8_SCK/SD_WR_PRT, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '12', peripheral: GPIO, signal: 'PIO2, 5', pin_signal: PIO2_5/ENET_TX_ER/SD_POW_EN/FC1_CTS_SDA_SSEL0/CTIMER1_MAT2, direction: OUTPUT}
  - {pin_num: '13', peripheral: GPIO, signal: 'PIO3, 14', pin_signal: PIO3_14/SCT0_OUT4/FC9_RTS_SCL_SSEL1/CTIMER3_MAT1/TRACEDATA(2), direction: INPUT}
  - {pin_num: '130', peripheral: GPIO, signal: 'PIO2, 27', pin_signal: PIO2_27/LCD_VD(9)/FC9_SCK/FC3_SSEL2, identifier: EGAINA, direction: OUTPUT, gpio_init_state: 'false'}
  - {pin_num: '37', peripheral: GPIO, signal: 'PIO3, 12', pin_signal: PIO3_12/SCT0_OUT8/CTIMER3_CAP0/CLKOUT/EMC_CLK(1)/TRACECLK, identifier: EGAINB, direction: OUTPUT,
    gpio_init_state: 'true', mode: pullUp}
  - {pin_num: '29', peripheral: GPIO, signal: 'PIO2, 7', pin_signal: PIO2_7/ENET_COL/SD_D(1)/FREQME_GPIO_CLK_B/CTIMER0_CAP1, direction: INPUT}
  - {pin_num: '43', peripheral: GPIO, signal: 'PIO2, 11', pin_signal: PIO2_11/LCD_PWR/SD_VOLT(0)/FC5_SCK, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '45', peripheral: GPIO, signal: 'PIO2, 12', pin_signal: PIO2_12/LCD_LE/SD_VOLT(1)/USB0_IDVALUE/FC5_RXD_SDA_MOSI, direction: OUTPUT, gpio_init_state: 'true',
    mode: pullUp, open_drain: disabled}
  - {pin_num: '46', peripheral: GPIO, signal: 'PIO3, 20', pin_signal: PIO3_20/FC9_SCK/SD_CARD_INT_N/CLKOUT/SCT0_OUT7, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '47', peripheral: GPIO, signal: 'PIO4, 22', pin_signal: PIO4_22/ENET_TXD3/SD_CARD_DET_N/FC2_RTS_SCL_SSEL1/CTIMER1_MAT3/EMC_D(17), direction: INPUT}
  - {pin_num: '51', peripheral: GPIO, signal: 'PIO0, 11', pin_signal: PIO0_11/FC6_RXD_SDA_MOSI_DATA/CTIMER2_MAT2/FREQME_GPIO_CLK_A/SWCLK/ADC0_1, direction: INPUT}
  - {pin_num: '55', peripheral: GPIO, signal: 'PIO0, 31', pin_signal: PIO0_31/FC0_CTS_SDA_SSEL0/SD_D(2)/CTIMER0_MAT1/SCT0_OUT3/TRACEDATA(0)/ADC0_5, direction: INPUT}
  - {pin_num: '56', peripheral: GPIO, signal: 'PIO1, 0', pin_signal: PIO1_0/FC0_RTS_SCL_SSEL1/SD_D(3)/CTIMER0_CAP2/SCT0_GPI4/TRACECLK/ADC0_6, direction: INPUT}
  - {pin_num: '68', peripheral: GPIO, signal: 'PIO3, 18', pin_signal: PIO3_18/FC8_CTS_SDA_SSEL0/SD_D(6)/CTIMER4_MAT0/CAN0_TD/SCT0_OUT5, direction: INPUT}
  - {pin_num: '75', peripheral: GPIO, signal: 'PIO3, 13', pin_signal: PIO3_13/SCT0_OUT9/FC9_CTS_SDA_SSEL0/CTIMER3_CAP1/EMC_FBCK/TRACEDATA(1), direction: INPUT}
  - {pin_num: '89', peripheral: GPIO, signal: 'PIO1, 22', pin_signal: PIO1_22/FC8_RTS_SCL_SSEL1/SD_CMD/CTIMER2_MAT3/SCT0_GPI5/FC4_SSEL3/EMC_CKE(1), direction: INPUT}
  - {pin_num: '90', peripheral: GPIO, signal: 'PIO2, 18', pin_signal: PIO2_18/LCD_VD(0)/FC3_RXD_SDA_MOSI/FC7_SCK/CTIMER3_MAT0, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '93', peripheral: GPIO, signal: 'PIO2, 19', pin_signal: PIO2_19/LCD_VD(1)/FC3_TXD_SCL_MISO/FC7_RXD_SDA_MOSI_DATA/CTIMER3_MAT1, direction: OUTPUT}
  - {pin_num: '95', peripheral: GPIO, signal: 'PIO2, 20', pin_signal: PIO2_20/LCD_VD(2)/FC3_RTS_SCL_SSEL1/FC7_TXD_SCL_MISO_WS/CTIMER3_MAT2/CTIMER4_CAP0, direction: INPUT}
  - {pin_num: '114', peripheral: GPIO, signal: 'PIO4, 31', pin_signal: PIO4_31/ENET_RX_CLK/SD_D(6)/CTIMER3_MAT1/FC4_SCK/EMC_D(26), direction: INPUT}
  - {pin_num: '124', peripheral: GPIO, signal: 'PIO2, 26', pin_signal: PIO2_26/LCD_VD(8)/FC3_SCK/CTIMER2_CAP1, direction: OUTPUT}
  - {pin_num: '147', peripheral: GPIO, signal: 'PIO4, 4', pin_signal: PIO4_4/FC4_SSEL3/FC0_RTS_SCL_SSEL1/SCT0_GPI5/EMC_DYCSN(3), direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '154', peripheral: GPIO, signal: 'PIO4, 5', pin_signal: PIO4_5/FC9_CTS_SDA_SSEL0/FC0_CTS_SDA_SSEL0/CTIMER4_MAT3/SCT0_GPI6/EMC_CKE(2), direction: INPUT}
  - {pin_num: '168', peripheral: GPIO, signal: 'PIO5, 10', pin_signal: PIO5_10/SCT0_GPI5/FC5_RTS_SCL_SSEL1/SCT0_OUT9/UTICK_CAP3, direction: INPUT}
  - {pin_num: '169', peripheral: GPIO, signal: 'PIO3, 3', pin_signal: PIO3_3/LCD_VD(17)/FC9_TXD_SCL_MISO, direction: OUTPUT, gpio_init_state: 'true'}
