Nithin3200/Project_ECG/board/pin_mux.c
  - {pin_num: '172', peripheral: GPIO, signal: 'PIO3, 4', pin_signal: PIO3_4/LCD_VD(18)/FC8_CTS_SDA_SSEL0/CTIMER4_CAP1, direction: INPUT}
  - {pin_num: '179', peripheral: GPIO, signal: 'PIO5, 9', pin_signal: PIO5_9/SCT0_GPI4/PDM0_DATA/FC5_CTS_SDA_SSEL0/SCT0_OUT8/TRACEDATA(3)/EMC_A(25), direction: INPUT}
  - {pin_num: '181', peripheral: GPIO, signal: 'PIO4, 10', pin_signal: PIO4_10/ENET_RX_DV/FC2_TXD_SCL_MISO/USB1_OVERCURRENTN/USB1_UP_LED/SCT0_GPI3, direction: INPUT}
  - {pin_num: '190', peripheral: GPIO, signal: 'PIO4, 13', pin_signal: PIO4_13/ENET_TX_EN/CTIMER4_MAT0/SCT0_GPI6, direction: INPUT}
  - {pin_num: '196', peripheral: PINT, signal: 'PINT, 0', pin_signal: PIO0_0/CAN1_RD/FC3_SCK/CTIMER0_MAT0/SCT0_GPI0/PDM0_CLK}
  - {pin_num: '199', peripheral: GPIO, signal: 'PIO3, 10', pin_signal: PIO3_10/SCT0_OUT3/CTIMER3_MAT0/EMC_DYCSN(1)/TRACEDATA(0), direction: OUTPUT}
  - {pin_num: '202', peripheral: GPIO, signal: 'PIO5, 2', pin_signal: PIO5_2/ENET_COL/SD_VOLT(1)/CTIMER3_CAP0/FC4_CTS_SDA_SSEL0/EMC_D(29), direction: INPUT}
  - {pin_num: '161', peripheral: GPIO, signal: 'PIO4, 6', pin_signal: PIO4_6/FC9_RTS_SCL_SSEL1/SCT0_GPI7/EMC_CKE(3), direction: INPUT}
  - {pin_num: '164', peripheral: GPIO, signal: 'PIO3, 2', pin_signal: PIO3_2/LCD_VD(16)/FC9_RXD_SDA_MOSI/CTIMER1_MAT2, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '167', peripheral: GPIO, signal: 'PIO0, 29', pin_signal: PIO0_29/FC0_RXD_SDA_MOSI/CTIMER2_MAT3/SCT0_OUT8/TRACEDATA(2), direction: INPUT}
  - {pin_num: '141', peripheral: PINT, signal: 'PINT, 2', pin_signal: PIO0_13/FC1_CTS_SDA_SSEL0/UTICK_CAP0/CTIMER0_CAP0/SCT0_GPI0/ENET_RXD0}
  - {pin_num: '144', peripheral: PINT, signal: 'PINT, 3', pin_signal: PIO0_14/FC1_RTS_SCL_SSEL1/UTICK_CAP1/CTIMER0_CAP1/SCT0_GPI1/ENET_RXD1}
  - {pin_num: '163', peripheral: PINT, signal: 'PINT, 4', pin_signal: PIO0_22/FC6_TXD_SCL_MISO_WS/UTICK_CAP1/CTIMER3_CAP3/SCT0_OUT3/USB0_VBUS}
  - {pin_num: '207', peripheral: PINT, signal: 'PINT, 5', pin_signal: PIO0_1/CAN1_TD/FC3_CTS_SDA_SSEL0/CTIMER0_CAP0/SCT0_GPI1/PDM0_DATA}
  - {pin_num: '145', peripheral: DMIC0, signal: 'CLK, 1', pin_signal: PIO5_5/SCT0_GPI0/PDM1_CLK/CTIMER3_CAP3/FC4_SSEL3/TRACECLK/EMC_A(21)}
  - {pin_num: '152', peripheral: DMIC0, signal: 'DATA, 1', pin_signal: PIO5_6/SCT0_GPI1/PDM1_DATA/FC5_SCK/SCT0_OUT5/TRACEDATA(0)/EMC_A(22)}
  - {pin_num: '44', peripheral: GPIO, signal: 'PIO3, 19', pin_signal: PIO3_19/FC8_RTS_SCL_SSEL1/SD_D(7)/CTIMER4_MAT1/CAN0_RD/SCT0_OUT6, direction: OUTPUT}
  - {pin_num: '116', peripheral: GPIO, signal: 'PIO3, 30', pin_signal: PIO3_30/FC9_CTS_SDA_SSEL0/SCT0_OUT4/FC4_SSEL2/EMC_A(19), direction: OUTPUT, open_drain: disabled}
  - {pin_num: '7', peripheral: SDIF, signal: SD_CLK, pin_signal: PIO2_3/ENET_TXD2/SD_CLK/FC1_RXD_SDA_MOSI/CTIMER2_MAT0, slew_rate: fast, open_drain: disabled}
  - {pin_num: '9', peripheral: SDIF, signal: SD_CMD, pin_signal: PIO2_4/ENET_TXD3/SD_CMD/FC1_TXD_SCL_MISO/CTIMER2_MAT1, slew_rate: fast, open_drain: disabled}
  - {pin_num: '17', peripheral: SDIF, signal: 'SD_D, 0', pin_signal: PIO2_6/ENET_TX_CLK/SD_D(0)/FC1_RTS_SCL_SSEL1/CTIMER0_CAP0, slew_rate: fast, open_drain: disabled}
  - {pin_num: '73', peripheral: SDIF, signal: 'SD_D, 1', pin_signal: PIO4_26/ENET_RXD3/SD_D(1)/UTICK_CAP2/CTIMER1_MAT3/EMC_D(21), slew_rate: fast, open_drain: disabled}
  - {pin_num: '32', peripheral: SDIF, signal: 'SD_D, 2', pin_signal: PIO2_8/ENET_RXD2/SD_D(2)/CTIMER0_MAT0, mode: pullUp, slew_rate: fast, open_drain: disabled}
  - {pin_num: '36', peripheral: SDIF, signal: 'SD_D, 3', pin_signal: PIO2_9/ENET_RXD3/SD_D(3)/CTIMER0_MAT1, slew_rate: fast, open_drain: disabled}
  - {pin_num: '39', peripheral: SDIF, signal: SD_CARD_DET, pin_signal: PIO2_10/ENET_RX_ER/SD_CARD_DET_N, open_drain: disabled}
  - {pin_num: '57', peripheral: FLEXCOMM0, signal: RXD_SDA_MOSI, pin_signal: PIO2_0/FC0_RXD_SDA_MOSI/CTIMER1_CAP0/ADC0_7}
  - {pin_num: '58', peripheral: FLEXCOMM0, signal: TXD_SCL_MISO, pin_signal: PIO2_1/FC0_TXD_SCL_MISO/CTIMER1_MAT0/ADC0_8}
  - {pin_num: '92', peripheral: FLEXCOMM1, signal: RXD_SDA_MOSI, pin_signal: PIO4_28/ENET_TX_ER/SD_D(3)/FC1_RXD_SDA_MOSI/CTIMER1_CAP1/EMC_D(23)}
  - {pin_num: '102', peripheral: FLEXCOMM1, signal: TXD_SCL_MISO, pin_signal: PIO4_29/ENET_RX_ER/SD_D(4)/FC1_TXD_SCL_MISO/CTIMER1_CAP2/EMC_D(24)}
  - {pin_num: '173', peripheral: FLEXCOMM2, signal: RXD_SDA_MOSI, pin_signal: PIO4_9/ENET_TXD1/FC2_RXD_SDA_MOSI/USB1_PORTPWRN/USB1_FRAME/SCT0_GPI2}
  - {pin_num: '34', peripheral: FLEXCOMM2, signal: TXD_SCL_MISO, pin_signal: PIO4_21/ENET_TXD2/SD_POW_EN/FC2_TXD_SCL_MISO/CTIMER2_MAT3/EMC_D(16)}
  - {pin_num: '109', peripheral: FLEXCOMM3, signal: RXD_SDA_MOSI, pin_signal: PIO1_1/FC3_RXD_SDA_MOSI/CTIMER0_CAP3/SCT0_GPI5/USB1_OVERCURRENTN}
  - {pin_num: '52', peripheral: FLEXCOMM3, signal: TXD_SCL_MISO, pin_signal: PIO0_12/FC3_TXD_SCL_MISO/FREQME_GPIO_CLK_B/SCT0_GPI7/SWDIO/ADC0_2}
  - {pin_num: '126', peripheral: FLEXCOMM4, signal: TXD_SCL_MISO, pin_signal: PIO5_1/ENET_CRS/SD_VOLT(0)/CTIMER3_MAT3/FC4_TXD_SCL_MISO/EMC_D(28)}
  - {pin_num: '122', peripheral: FLEXCOMM4, signal: RXD_SDA_MOSI, pin_signal: PIO5_0/ENET_RX_DV/SD_D(7)/CTIMER3_MAT2/FC4_RXD_SDA_MOSI/EMC_D(27)}
  - {pin_num: '171', peripheral: FLEXCOMM5, signal: RXD_SDA_MOSI, pin_signal: PIO5_7/SCT0_GPI2/MCLK/FC5_RXD_SDA_MOSI/SCT0_OUT6/TRACEDATA(1)/EMC_A(23)}
  - {pin_num: '175', peripheral: FLEXCOMM5, signal: TXD_SCL_MISO, pin_signal: PIO5_8/SCT0_GPI3/PDM0_CLK/FC5_TXD_SCL_MISO/SCT0_OUT7/TRACEDATA(2)/EMC_A(24)}
  - {pin_num: '19', peripheral: FLEXCOMM8, signal: RXD_SDA_MOSI, pin_signal: PIO3_16/FC8_RXD_SDA_MOSI/SD_D(4)}
  - {pin_num: '31', peripheral: FLEXCOMM8, signal: TXD_SCL_MISO, pin_signal: PIO3_17/FC8_TXD_SCL_MISO/SD_D(5)}
  - {pin_num: '197', peripheral: FLEXCOMM9, signal: RXD_SDA_MOSI, pin_signal: PIO4_15/ENET_MDC/CTIMER4_MAT2/FC9_RXD_SDA_MOSI}
  - {pin_num: '203', peripheral: FLEXCOMM9, signal: TXD_SCL_MISO, pin_signal: PIO4_16/ENET_MDIO/CTIMER4_MAT3/FC9_TXD_SCL_MISO}
  - {pin_num: '50', peripheral: FLEXCOMM6, signal: SCK, pin_signal: PIO0_10/FC6_SCK/CTIMER2_CAP2/CTIMER2_MAT0/FC1_TXD_SCL_MISO/SWO/ADC0_0}
  - {pin_num: '140', peripheral: FLEXCOMM6, signal: TXD_SCL_MISO_WS, pin_signal: PIO4_3/FC6_TXD_SCL_MISO_WS/CTIMER0_CAP3/SCT0_GPI4/EMC_DYCSN(2)}
  - {pin_num: '138', peripheral: FLEXCOMM6, signal: RXD_SDA_MOSI_DATA, pin_signal: PIO4_2/FC6_RXD_SDA_MOSI_DATA/SCT0_GPI3/EMC_CSN(3)}
  - {pin_num: '123', peripheral: SCT0, signal: 'OUT, 5', pin_signal: PIO3_31/FC9_RTS_SCL_SSEL1/SCT0_OUT5/CTIMER4_MAT2/SCT0_GPI0/EMC_A(20)}
  - {pin_num: '67', peripheral: FLEXCOMM7, signal: RTS_SCL_SSEL1, pin_signal: PIO4_24/ENET_RXD1/SD_CARD_INT_N/FC7_RTS_SCL_SSEL1/CTIMER1_MAT1/EMC_D(19)}
  - {pin_num: '120', peripheral: PINT, signal: 'PINT, 1', pin_signal: PIO1_3/CAN0_RD/SCT0_OUT4/PDM1_DATA/USB0_PORTPWRN, identifier: ENCA}
  - {pin_num: '200', peripheral: PINT, signal: 'PINT, 6', pin_signal: PIO0_30/FC0_TXD_SCL_MISO/CTIMER0_MAT0/SCT0_OUT9/TRACEDATA(1), identifier: ENCB}
  - {pin_num: '208', peripheral: SYSCON, signal: MCLK, pin_signal: PIO3_11/MCLK/FC0_SCK/FC1_SCK/TRACEDATA(3), direction: OUTPUT}
  - {pin_num: '86', peripheral: USBHSH, signal: USB_OVERCURRENTN, pin_signal: PIO2_17/LCD_CLKIN/USB1_UP_LED/USB1_OVERCURRENTN/CTIMER1_CAP1/FC8_RXD_SDA_MOSI}
  - {pin_num: '117', peripheral: USBHSH, signal: USB_PORTPWRN, pin_signal: PIO1_2/CAN0_TD/CTIMER0_MAT3/SCT0_GPI6/PDM1_CLK/USB1_PORTPWRN}
  - {pin_num: '170', peripheral: USBFSH, signal: USB_OVERCURRENTN, pin_signal: PIO4_8/ENET_TXD0/FC2_SCK/USB0_OVERCURRENTN/USB0_UP_LED/SCT0_GPI1}
  - {pin_num: '183', peripheral: USBFSH, signal: USB_IDVALUE, pin_signal: PIO4_11/ENET_RXD0/FC2_CTS_SDA_SSEL0/USB0_IDVALUE/SCT0_GPI4}
  - {pin_num: '166', peripheral: GPIO, signal: 'PIO4, 7', pin_signal: PIO4_7/CTIMER4_CAP3/USB0_PORTPWRN/USB0_FRAME/SCT0_GPI0, direction: OUTPUT, gpio_init_state: 'false'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

