Nithin3200/Project_ECG/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4F */
void BOARD_InitPins(void)
{
    /* Enables the clock for the input muxes. 0 = Disable; 1 = Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_InputMux);
    /* Enables the clock for the IOCON block. 0 = Disable; 1 = Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_Iocon);
    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);
    /* Enables the clock for the GPIO1 module */
    CLOCK_EnableClock(kCLOCK_Gpio1);
    /* Enables the clock for the GPIO2 module */
    CLOCK_EnableClock(kCLOCK_Gpio2);
    /* Enables the clock for the GPIO3 module */
    CLOCK_EnableClock(kCLOCK_Gpio3);
    /* Enables the clock for the GPIO4 module */
    CLOCK_EnableClock(kCLOCK_Gpio4);
    /* Enables the clock for the GPIO5 module */
    CLOCK_EnableClock(kCLOCK_Gpio5);

    gpio_pin_config_t Charge_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_11 (pin 51)  */
    GPIO_PinInit(BOARD_INITPINS_Charge_GPIO, BOARD_INITPINS_Charge_PORT, BOARD_INITPINS_Charge_PIN, &Charge_config);

    gpio_pin_config_t PWR_IN_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_29 (pin 167)  */
    GPIO_PinInit(BOARD_INITPINS_PWR_IN_GPIO, BOARD_INITPINS_PWR_IN_PORT, BOARD_INITPINS_PWR_IN_PIN, &PWR_IN_config);

    gpio_pin_config_t AED_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_31 (pin 55)  */
    GPIO_PinInit(BOARD_INITPINS_AED_GPIO, BOARD_INITPINS_AED_PORT, BOARD_INITPINS_AED_PIN, &AED_config);

    gpio_pin_config_t Discharged_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_0 (pin 56)  */
    GPIO_PinInit(BOARD_INITPINS_Discharged_GPIO, BOARD_INITPINS_Discharged_PORT, BOARD_INITPINS_Discharged_PIN, &Discharged_config);

    gpio_pin_config_t QRSTrig_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_22 (pin 89)  */
    GPIO_PinInit(BOARD_INITPINS_QRSTrig_GPIO, BOARD_INITPINS_QRSTrig_PORT, BOARD_INITPINS_QRSTrig_PIN, &QRSTrig_config);

    gpio_pin_config_t SW_ERR_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_5 (pin 12)  */
    GPIO_PinInit(BOARD_INITPINS_SW_ERR_GPIO, BOARD_INITPINS_SW_ERR_PORT, BOARD_INITPINS_SW_ERR_PIN, &SW_ERR_config);

    gpio_pin_config_t Enter_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_7 (pin 29)  */
    GPIO_PinInit(BOARD_INITPINS_Enter_GPIO, BOARD_INITPINS_Enter_PORT, BOARD_INITPINS_Enter_PIN, &Enter_config);

    gpio_pin_config_t QRS_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO2_11 (pin 43)  */
    GPIO_PinInit(BOARD_INITPINS_QRS_GPIO, BOARD_INITPINS_QRS_PORT, BOARD_INITPINS_QRS_PIN, &QRS_config);

    gpio_pin_config_t DSCHG_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO2_12 (pin 45)  */
    GPIO_PinInit(BOARD_INITPINS_DSCHG_GPIO, BOARD_INITPINS_DSCHG_PORT, BOARD_INITPINS_DSCHG_PIN, &DSCHG_config);

    gpio_pin_config_t HVRST_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO2_18 (pin 90)  */
    GPIO_PinInit(BOARD_INITPINS_HVRST_GPIO, BOARD_INITPINS_HVRST_PORT, BOARD_INITPINS_HVRST_PIN, &HVRST_config);

    gpio_pin_config_t QRSMux2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_19 (pin 93)  */
    GPIO_PinInit(BOARD_INITPINS_QRSMux2_GPIO, BOARD_INITPINS_QRSMux2_PORT, BOARD_INITPINS_QRSMux2_PIN, &QRSMux2_config);

    gpio_pin_config_t Event_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_20 (pin 95)  */
    GPIO_PinInit(BOARD_INITPINS_Event_GPIO, BOARD_INITPINS_Event_PORT, BOARD_INITPINS_Event_PIN, &Event_config);

    gpio_pin_config_t QRSMux1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_26 (pin 124)  */
    GPIO_PinInit(BOARD_INITPINS_QRSMux1_GPIO, BOARD_INITPINS_QRSMux1_PORT, BOARD_INITPINS_QRSMux1_PIN, &QRSMux1_config);

    gpio_pin_config_t EGAINA_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_27 (pin 130)  */
    GPIO_PinInit(BOARD_INITPINS_EGAINA_GPIO, BOARD_INITPINS_EGAINA_PORT, BOARD_INITPINS_EGAINA_PIN, &EGAINA_config);

    gpio_pin_config_t Print_Rst_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO3_2 (pin 164)  */
    GPIO_PinInit(BOARD_INITPINS_Print_Rst_GPIO, BOARD_INITPINS_Print_Rst_PORT, BOARD_INITPINS_Print_Rst_PIN, &Print_Rst_config);

    gpio_pin_config_t RENReset_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO3_3 (pin 169)  */
    GPIO_PinInit(BOARD_INITPINS_RENReset_GPIO, BOARD_INITPINS_RENReset_PORT, BOARD_INITPINS_RENReset_PIN, &RENReset_config);

