Nithin3200/Project_ECG/board/pin_mux.c
    gpio_pin_config_t AudioEn_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_4 (pin 172)  */
    GPIO_PinInit(BOARD_INITPINS_AudioEn_GPIO, BOARD_INITPINS_AudioEn_PORT, BOARD_INITPINS_AudioEn_PIN, &AudioEn_config);

    gpio_pin_config_t PWRHld_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_10 (pin 199)  */
    GPIO_PinInit(BOARD_INITPINS_PWRHld_GPIO, BOARD_INITPINS_PWRHld_PORT, BOARD_INITPINS_PWRHld_PIN, &PWRHld_config);

    gpio_pin_config_t EGAINB_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO3_12 (pin 37)  */
    GPIO_PinInit(BOARD_INITPINS_EGAINB_GPIO, BOARD_INITPINS_EGAINB_PORT, BOARD_INITPINS_EGAINB_PIN, &EGAINB_config);

    gpio_pin_config_t Sync_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_13 (pin 75)  */
    GPIO_PinInit(BOARD_INITPINS_Sync_GPIO, BOARD_INITPINS_Sync_PORT, BOARD_INITPINS_Sync_PIN, &Sync_config);

    gpio_pin_config_t Incr_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_14 (pin 13)  */
    GPIO_PinInit(BOARD_INITPINS_Incr_GPIO, BOARD_INITPINS_Incr_PORT, BOARD_INITPINS_Incr_PIN, &Incr_config);

    gpio_pin_config_t Port_Exp_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO3_15 (pin 11)  */
    GPIO_PinInit(BOARD_INITPINS_Port_Exp_GPIO, BOARD_INITPINS_Port_Exp_PORT, BOARD_INITPINS_Port_Exp_PIN, &Port_Exp_config);

    gpio_pin_config_t Pacer_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_18 (pin 68)  */
    GPIO_PinInit(BOARD_INITPINS_Pacer_GPIO, BOARD_INITPINS_Pacer_PORT, BOARD_INITPINS_Pacer_PIN, &Pacer_config);

    gpio_pin_config_t LED1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_19 (pin 44)  */
    GPIO_PinInit(BOARD_INITPINS_LED1_GPIO, BOARD_INITPINS_LED1_PORT, BOARD_INITPINS_LED1_PIN, &LED1_config);

    gpio_pin_config_t KeyBuff_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO3_20 (pin 46)  */
    GPIO_PinInit(BOARD_INITPINS_KeyBuff_GPIO, BOARD_INITPINS_KeyBuff_PORT, BOARD_INITPINS_KeyBuff_PIN, &KeyBuff_config);

    gpio_pin_config_t ECGMUX1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_23 (pin 8)  */
    GPIO_PinInit(BOARD_INITPINS_ECGMUX1_GPIO, BOARD_INITPINS_ECGMUX1_PORT, BOARD_INITPINS_ECGMUX1_PIN, &ECGMUX1_config);

    gpio_pin_config_t LED2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_30 (pin 116)  */
    GPIO_PinInit(BOARD_INITPINS_LED2_GPIO, BOARD_INITPINS_LED2_PORT, BOARD_INITPINS_LED2_PIN, &LED2_config);

    gpio_pin_config_t PacerEN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO4_4 (pin 147)  */
    GPIO_PinInit(BOARD_INITPINS_PacerEN_GPIO, BOARD_INITPINS_PacerEN_PORT, BOARD_INITPINS_PacerEN_PIN, &PacerEN_config);

    gpio_pin_config_t Print_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_5 (pin 154)  */
    GPIO_PinInit(BOARD_INITPINS_Print_GPIO, BOARD_INITPINS_Print_PORT, BOARD_INITPINS_Print_PIN, &Print_config);

    gpio_pin_config_t Cartridge_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_6 (pin 161)  */
    GPIO_PinInit(BOARD_INITPINS_Cartridge_GPIO, BOARD_INITPINS_Cartridge_PORT, BOARD_INITPINS_Cartridge_PIN, &Cartridge_config);

    gpio_pin_config_t USB0PWR_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_7 (pin 166)  */
    GPIO_PinInit(BOARD_INITPINS_USB0PWR_GPIO, BOARD_INITPINS_USB0PWR_PORT, BOARD_INITPINS_USB0PWR_PIN, &USB0PWR_config);

    gpio_pin_config_t Mute_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_10 (pin 181)  */
    GPIO_PinInit(BOARD_INITPINS_Mute_GPIO, BOARD_INITPINS_Mute_PORT, BOARD_INITPINS_Mute_PIN, &Mute_config);

    gpio_pin_config_t Manual_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_13 (pin 190)  */
    GPIO_PinInit(BOARD_INITPINS_Manual_GPIO, BOARD_INITPINS_Manual_PORT, BOARD_INITPINS_Manual_PIN, &Manual_config);

    gpio_pin_config_t WDT_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_17 (pin 6)  */
    GPIO_PinInit(BOARD_INITPINS_WDT_GPIO, BOARD_INITPINS_WDT_PORT, BOARD_INITPINS_WDT_PIN, &WDT_config);

    gpio_pin_config_t DEC_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_18 (pin 10)  */
    GPIO_PinInit(BOARD_INITPINS_DEC_GPIO, BOARD_INITPINS_DEC_PORT, BOARD_INITPINS_DEC_PIN, &DEC_config);

    gpio_pin_config_t Battfull_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_22 (pin 47)  */
    GPIO_PinInit(BOARD_INITPINS_Battfull_GPIO, BOARD_INITPINS_Battfull_PORT, BOARD_INITPINS_Battfull_PIN, &Battfull_config);

    gpio_pin_config_t CPR_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_31 (pin 114)  */
    GPIO_PinInit(BOARD_INITPINS_CPR_GPIO, BOARD_INITPINS_CPR_PORT, BOARD_INITPINS_CPR_PIN, &CPR_config);

