Nithin3200/Project_ECG/board/pin_mux.c
                        /* Controls open-drain mode.
                         * : Normal.
                         * Normal push-pull output. */
                        | IOCON_PIO_OD(PIO24_OD_NORMAL));

    IOCON->PIO[2][5] = ((IOCON->PIO[2][5] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.
                         * : PORT25 (pin 12) is configured as PIO2_5. */
                        | IOCON_PIO_FUNC(PIO25_FUNC_ALT0)

                        /* Select Analog/Digital mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO25_DIGIMODE_DIGITAL));

    IOCON->PIO[2][6] = ((IOCON->PIO[2][6] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK | IOCON_PIO_SLEW_MASK | IOCON_PIO_OD_MASK)))

                        /* Selects pin function.
                         * : PORT26 (pin 17) is configured as SD_D(0). */
                        | IOCON_PIO_FUNC(PIO26_FUNC_ALT2)

                        /* Select Analog/Digital mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO26_DIGIMODE_DIGITAL)

                        /* Driver slew rate.
                         * : Fast mode, slew rate control is disabled.
                         * Refer to the appropriate specific device data sheet for details. */
                        | IOCON_PIO_SLEW(PIO26_SLEW_FAST)

                        /* Controls open-drain mode.
                         * : Normal.
                         * Normal push-pull output. */
                        | IOCON_PIO_OD(PIO26_OD_NORMAL));

    IOCON->PIO[2][7] = ((IOCON->PIO[2][7] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.
                         * : PORT27 (pin 29) is configured as PIO2_7. */
                        | IOCON_PIO_FUNC(PIO27_FUNC_ALT0)

                        /* Select Analog/Digital mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO27_DIGIMODE_DIGITAL));

    IOCON->PIO[2][8] =
        ((IOCON->PIO[2][8] &
          /* Mask bits to zero which are setting */
          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_MODE_MASK | IOCON_PIO_DIGIMODE_MASK | IOCON_PIO_SLEW_MASK | IOCON_PIO_OD_MASK)))

         /* Selects pin function.
          * : PORT28 (pin 32) is configured as SD_D(2). */
         | IOCON_PIO_FUNC(PIO28_FUNC_ALT2)

         /* Selects function mode (on-chip pull-up/pull-down resistor control).
          * : Pull-up.
          * Pull-up resistor enabled. */
         | IOCON_PIO_MODE(PIO28_MODE_PULL_UP)

         /* Select Analog/Digital mode.
          * : Digital mode. */
         | IOCON_PIO_DIGIMODE(PIO28_DIGIMODE_DIGITAL)

         /* Driver slew rate.
          * : Fast mode, slew rate control is disabled.
          * Refer to the appropriate specific device data sheet for details. */
         | IOCON_PIO_SLEW(PIO28_SLEW_FAST)

         /* Controls open-drain mode.
          * : Normal.
          * Normal push-pull output. */
         | IOCON_PIO_OD(PIO28_OD_NORMAL));

    IOCON->PIO[2][9] = ((IOCON->PIO[2][9] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK | IOCON_PIO_SLEW_MASK | IOCON_PIO_OD_MASK)))

                        /* Selects pin function.
                         * : PORT29 (pin 36) is configured as SD_D(3). */
                        | IOCON_PIO_FUNC(PIO29_FUNC_ALT2)

                        /* Select Analog/Digital mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO29_DIGIMODE_DIGITAL)

                        /* Driver slew rate.
                         * : Fast mode, slew rate control is disabled.
                         * Refer to the appropriate specific device data sheet for details. */
                        | IOCON_PIO_SLEW(PIO29_SLEW_FAST)

                        /* Controls open-drain mode.
                         * : Normal.
                         * Normal push-pull output. */
                        | IOCON_PIO_OD(PIO29_OD_NORMAL));

    IOCON->PIO[3][0] = ((IOCON->PIO[3][0] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK | IOCON_PIO_SLEW_MASK)))

                        /* Selects pin function.
                         * : PORT30 (pin 155) is configured as LCD_VD(14). */
                        | IOCON_PIO_FUNC(PIO30_FUNC_ALT1)

                        /* Select Analog/Digital mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO30_DIGIMODE_DIGITAL)

                        /* Driver slew rate.
                         * : Fast mode, slew rate control is disabled.
                         * Refer to the appropriate specific device data sheet for details. */
                        | IOCON_PIO_SLEW(PIO30_SLEW_FAST));

    IOCON->PIO[3][1] = ((IOCON->PIO[3][1] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK | IOCON_PIO_SLEW_MASK)))

                        /* Selects pin function.
                         * : PORT31 (pin 159) is configured as LCD_VD(15). */
                        | IOCON_PIO_FUNC(PIO31_FUNC_ALT1)

                        /* Select Analog/Digital mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO31_DIGIMODE_DIGITAL)

                        /* Driver slew rate.
                         * : Fast mode, slew rate control is disabled.
                         * Refer to the appropriate specific device data sheet for details. */
                        | IOCON_PIO_SLEW(PIO31_SLEW_FAST));

    IOCON->PIO[3][10] = ((IOCON->PIO[3][10] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT310 (pin 199) is configured as PIO3_10. */
                         | IOCON_PIO_FUNC(PIO310_FUNC_ALT0)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO310_DIGIMODE_DIGITAL));

