Nithin3200/Project_ECG/board/pin_mux.c
    IOCON->PIO[4][15] = ((IOCON->PIO[4][15] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT415 (pin 197) is configured as FC9_RXD_SDA_MOSI. */
                         | IOCON_PIO_FUNC(PIO415_FUNC_ALT3)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO415_DIGIMODE_DIGITAL));

    IOCON->PIO[4][16] = ((IOCON->PIO[4][16] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT416 (pin 203) is configured as FC9_TXD_SCL_MISO. */
                         | IOCON_PIO_FUNC(PIO416_FUNC_ALT3)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO416_DIGIMODE_DIGITAL));

    IOCON->PIO[4][17] = ((IOCON->PIO[4][17] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT417 (pin 6) is configured as PIO4_17. */
                         | IOCON_PIO_FUNC(PIO417_FUNC_ALT0)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO417_DIGIMODE_DIGITAL));

    IOCON->PIO[4][18] = ((IOCON->PIO[4][18] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT418 (pin 10) is configured as PIO4_18. */
                         | IOCON_PIO_FUNC(PIO418_FUNC_ALT0)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO418_DIGIMODE_DIGITAL));

    IOCON->PIO[4][19] = ((IOCON->PIO[4][19] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT419 (pin 14) is configured as ENET_TXD0. */
                         | IOCON_PIO_FUNC(PIO419_FUNC_ALT1)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO419_DIGIMODE_DIGITAL));

    IOCON->PIO[4][2] = ((IOCON->PIO[4][2] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.
                         * : PORT42 (pin 138) is configured as FC6_RXD_SDA_MOSI_DATA. */
                        | IOCON_PIO_FUNC(PIO42_FUNC_ALT2)

                        /* Select Analog/Digital mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO42_DIGIMODE_DIGITAL));

    IOCON->PIO[4][20] = ((IOCON->PIO[4][20] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT420 (pin 18) is configured as ENET_TXD1. */
                         | IOCON_PIO_FUNC(PIO420_FUNC_ALT1)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO420_DIGIMODE_DIGITAL));

    IOCON->PIO[4][21] = ((IOCON->PIO[4][21] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT421 (pin 34) is configured as FC2_TXD_SCL_MISO. */
                         | IOCON_PIO_FUNC(PIO421_FUNC_ALT3)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO421_DIGIMODE_DIGITAL));

    IOCON->PIO[4][22] = ((IOCON->PIO[4][22] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT422 (pin 47) is configured as PIO4_22. */
                         | IOCON_PIO_FUNC(PIO422_FUNC_ALT0)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO422_DIGIMODE_DIGITAL));

    IOCON->PIO[4][23] = ((IOCON->PIO[4][23] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT423 (pin 42) is configured as ENET_RXD0. */
                         | IOCON_PIO_FUNC(PIO423_FUNC_ALT1)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO423_DIGIMODE_DIGITAL));

    IOCON->PIO[4][24] = ((IOCON->PIO[4][24] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT424 (pin 67) is configured as FC7_RTS_SCL_SSEL1. */
                         | IOCON_PIO_FUNC(PIO424_FUNC_ALT3)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO424_DIGIMODE_DIGITAL));

    IOCON->PIO[4][25] =
        ((IOCON->PIO[4][25] &
          /* Mask bits to zero which are setting */
          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_MODE_MASK | IOCON_PIO_DIGIMODE_MASK | IOCON_PIO_SLEW_MASK | IOCON_PIO_OD_MASK)))

         /* Selects pin function.
          * : PORT425 (pin 69) is configured as FC7_CTS_SDA_SSEL0. */
         | IOCON_PIO_FUNC(PIO425_FUNC_ALT3)

         /* Selects function mode (on-chip pull-up/pull-down resistor control).
          * : Pull-down.
          * Pull-down resistor enabled. */
         | IOCON_PIO_MODE(PIO425_MODE_PULL_DOWN)

         /* Select Analog/Digital mode.
          * : Digital mode. */
         | IOCON_PIO_DIGIMODE(PIO425_DIGIMODE_DIGITAL)

         /* Driver slew rate.
          * : Fast mode, slew rate control is disabled.
          * Refer to the appropriate specific device data sheet for details. */
         | IOCON_PIO_SLEW(PIO425_SLEW_FAST)

