Nithin3200/Project_ECG/board/pin_mux.c
         /* Controls open-drain mode.
          * : Open-drain.
          * Simulated open-drain output (high drive disabled). */
         | IOCON_PIO_OD(PIO425_OD_OPEN_DRAIN));

    IOCON->PIO[4][26] = ((IOCON->PIO[4][26] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK | IOCON_PIO_SLEW_MASK | IOCON_PIO_OD_MASK)))

                         /* Selects pin function.
                          * : PORT426 (pin 73) is configured as SD_D(1). */
                         | IOCON_PIO_FUNC(PIO426_FUNC_ALT2)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO426_DIGIMODE_DIGITAL)

                         /* Driver slew rate.
                          * : Fast mode, slew rate control is disabled.
                          * Refer to the appropriate specific device data sheet for details. */
                         | IOCON_PIO_SLEW(PIO426_SLEW_FAST)

                         /* Controls open-drain mode.
                          * : Normal.
                          * Normal push-pull output. */
                         | IOCON_PIO_OD(PIO426_OD_NORMAL));

    IOCON->PIO[4][27] = ((IOCON->PIO[4][27] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT427 (pin 85) is configured as ENET_TX_EN. */
                         | IOCON_PIO_FUNC(PIO427_FUNC_ALT1)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO427_DIGIMODE_DIGITAL));

    IOCON->PIO[4][28] = ((IOCON->PIO[4][28] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT428 (pin 92) is configured as FC1_RXD_SDA_MOSI. */
                         | IOCON_PIO_FUNC(PIO428_FUNC_ALT4)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO428_DIGIMODE_DIGITAL));

    IOCON->PIO[4][29] = ((IOCON->PIO[4][29] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT429 (pin 102) is configured as FC1_TXD_SCL_MISO. */
                         | IOCON_PIO_FUNC(PIO429_FUNC_ALT4)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO429_DIGIMODE_DIGITAL));

    IOCON->PIO[4][3] = ((IOCON->PIO[4][3] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.
                         * : PORT43 (pin 140) is configured as FC6_TXD_SCL_MISO_WS. */
                        | IOCON_PIO_FUNC(PIO43_FUNC_ALT2)

                        /* Select Analog/Digital mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO43_DIGIMODE_DIGITAL));

    IOCON->PIO[4][30] = ((IOCON->PIO[4][30] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT430 (pin 80) is configured as ENET_TX_CLK. */
                         | IOCON_PIO_FUNC(PIO430_FUNC_ALT1)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO430_DIGIMODE_DIGITAL));

    IOCON->PIO[4][31] = ((IOCON->PIO[4][31] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT431 (pin 114) is configured as PIO4_31. */
                         | IOCON_PIO_FUNC(PIO431_FUNC_ALT0)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO431_DIGIMODE_DIGITAL));

    IOCON->PIO[4][4] = ((IOCON->PIO[4][4] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.
                         * : PORT44 (pin 147) is configured as PIO4_4. */
                        | IOCON_PIO_FUNC(PIO44_FUNC_ALT0)

                        /* Select Analog/Digital mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO44_DIGIMODE_DIGITAL));

    IOCON->PIO[4][5] = ((IOCON->PIO[4][5] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.
                         * : PORT45 (pin 154) is configured as PIO4_5. */
                        | IOCON_PIO_FUNC(PIO45_FUNC_ALT0)

                        /* Select Analog/Digital mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO45_DIGIMODE_DIGITAL));

    IOCON->PIO[4][6] = ((IOCON->PIO[4][6] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.
                         * : PORT46 (pin 161) is configured as PIO4_6. */
                        | IOCON_PIO_FUNC(PIO46_FUNC_ALT0)

                        /* Select Analog/Digital mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO46_DIGIMODE_DIGITAL));

    IOCON->PIO[4][7] = ((IOCON->PIO[4][7] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.
                         * : PORT47 (pin 166) is configured as PIO4_7. */
                        | IOCON_PIO_FUNC(PIO47_FUNC_ALT0)

                        /* Select Analog/Digital mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO47_DIGIMODE_DIGITAL));

    IOCON->PIO[4][8] = ((IOCON->PIO[4][8] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.
                         * : PORT48 (pin 170) is configured as USB0_OVERCURRENTN. */
                        | IOCON_PIO_FUNC(PIO48_FUNC_ALT3)

                        /* Select Analog/Digital mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO48_DIGIMODE_DIGITAL));

