Nithin3200/Project_ECG/board/pin_mux.c
    IOCON->PIO[4][9] = ((IOCON->PIO[4][9] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.
                         * : PORT49 (pin 173) is configured as FC2_RXD_SDA_MOSI. */
                        | IOCON_PIO_FUNC(PIO49_FUNC_ALT2)

                        /* Select Analog/Digital mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO49_DIGIMODE_DIGITAL));

    IOCON->PIO[5][0] = ((IOCON->PIO[5][0] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.
                         * : PORT50 (pin 122) is configured as FC4_RXD_SDA_MOSI. */
                        | IOCON_PIO_FUNC(PIO50_FUNC_ALT4)

                        /* Select Analog/Digital mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO50_DIGIMODE_DIGITAL));

    IOCON->PIO[5][1] = ((IOCON->PIO[5][1] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.
                         * : PORT51 (pin 126) is configured as FC4_TXD_SCL_MISO. */
                        | IOCON_PIO_FUNC(PIO51_FUNC_ALT4)

                        /* Select Analog/Digital mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO51_DIGIMODE_DIGITAL));

    IOCON->PIO[5][10] = ((IOCON->PIO[5][10] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT510 (pin 168) is configured as PIO5_10. */
                         | IOCON_PIO_FUNC(PIO510_FUNC_ALT0)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO510_DIGIMODE_DIGITAL));

    IOCON->PIO[5][2] = ((IOCON->PIO[5][2] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.
                         * : PORT52 (pin 202) is configured as PIO5_2. */
                        | IOCON_PIO_FUNC(PIO52_FUNC_ALT0)

                        /* Select Analog/Digital mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO52_DIGIMODE_DIGITAL));

    IOCON->PIO[5][3] = ((IOCON->PIO[5][3] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.
                         * : PORT53 (pin 129) is configured as ENET_MDC. */
                        | IOCON_PIO_FUNC(PIO53_FUNC_ALT1)

                        /* Select Analog/Digital mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO53_DIGIMODE_DIGITAL));

    IOCON->PIO[5][4] = ((IOCON->PIO[5][4] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.
                         * : PORT54 (pin 135) is configured as ENET_MDIO. */
                        | IOCON_PIO_FUNC(PIO54_FUNC_ALT1)

                        /* Select Analog/Digital mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO54_DIGIMODE_DIGITAL));

    IOCON->PIO[5][5] = ((IOCON->PIO[5][5] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.
                         * : PORT55 (pin 145) is configured as PDM1_CLK. */
                        | IOCON_PIO_FUNC(PIO55_FUNC_ALT2)

                        /* Select Analog/Digital mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO55_DIGIMODE_DIGITAL));

    IOCON->PIO[5][6] = ((IOCON->PIO[5][6] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.
                         * : PORT56 (pin 152) is configured as PDM1_DATA. */
                        | IOCON_PIO_FUNC(PIO56_FUNC_ALT2)

                        /* Select Analog/Digital mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO56_DIGIMODE_DIGITAL));

    IOCON->PIO[5][7] = ((IOCON->PIO[5][7] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.
                         * : PORT57 (pin 171) is configured as FC5_RXD_SDA_MOSI. */
                        | IOCON_PIO_FUNC(PIO57_FUNC_ALT3)

                        /* Select Analog/Digital mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO57_DIGIMODE_DIGITAL));

    IOCON->PIO[5][8] = ((IOCON->PIO[5][8] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.
                         * : PORT58 (pin 175) is configured as FC5_TXD_SCL_MISO. */
                        | IOCON_PIO_FUNC(PIO58_FUNC_ALT3)

                        /* Select Analog/Digital mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO58_DIGIMODE_DIGITAL));

    IOCON->PIO[5][9] = ((IOCON->PIO[5][9] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.
                         * : PORT59 (pin 179) is configured as PIO5_9. */
                        | IOCON_PIO_FUNC(PIO59_FUNC_ALT0)

                        /* Select Analog/Digital mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO59_DIGIMODE_DIGITAL));

    SYSCON->MCLKIO = ((SYSCON->MCLKIO &
                       /* Mask bits to zero which are setting */
                       (~(SYSCON_MCLKIO_DIR_MASK)))

                      /* MCLK direction control.
                       * : 0x01u. */
                      | SYSCON_MCLKIO_DIR(0x01u));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
